Revit 2027 API
RevitAPIPreDocEventArgs Class
 The base class used for pre events where the arguments must supply access to the document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 More
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitAPIPreDocEventArgs : RevitAPIPreEventArgs
Public Class RevitAPIPreDocEventArgs
	Inherits RevitAPIPreEventArgs
public ref class RevitAPIPreDocEventArgs : public RevitAPIPreEventArgs
type RevitAPIPreDocEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The RevitAPIPreDocEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Document |  The document associated with the event.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Top
Methods
Name | Description
Cancel |  When the event is cancellable, may call the Cancel() method to cancel it.
(Inherited from RevitAPIPreEventArgs)
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentClosingEventArgs
 Autodesk.Revit.DB.Events.DocumentPrintingEventArgs
 Autodesk.Revit.DB.Events.DocumentReloadingLatestEventArgs
 Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs
 Autodesk.Revit.DB.Events.DocumentSavingEventArgs
 Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs
 Autodesk.Revit.DB.Events.ElementTypeDuplicatingEventArgs
 Autodesk.Revit.DB.Events.FamilyLoadingIntoDocumentEventArgs
 Autodesk.Revit.DB.Events.FileExportingEventArgs
 Autodesk.Revit.DB.Events.FileImportingEventArgs
 Autodesk.Revit.DB.Events.ViewExportingEventArgs
 Autodesk.Revit.DB.Events.ViewPrintingEventArgs
 Autodesk.Revit.DB.Events.ViewsExportingByContextEventArgs
 Autodesk.Revit.UI.Events.TransferringProjectStandardsEventArgs
 Autodesk.Revit.UI.Events.ViewActivatingEventArgs